In [17]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName("Practise").getOrCreate()

In [2]:
df_pyspark=spark.read.csv('pyspark_test_data_2.csv',header=True,inferSchema=True)

In [3]:
df_pyspark.show()

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
| Shayema|  22|        10| 30000|
|Ehtasham|  19|         8| 25000|
| Mosahid|  24|         4| 40000|
|  Saheda|  44|         3| 31000|
|  Ghulam|  45|        21| 72000|
| Mujtaba|   9|         2| 80000|
|    Neha|  23|         1| 18000|
|    Puja|null|      null| 40000|
|    null|  34|        10| 36000|
|    null|  35|      null|  null|
+--------+----+----------+------+

# Drop the columns

In [4]:
df_pyspark.drop('Name').show()

+----+----------+------+
| age|Experience|Salary|
+----+----------+------+
|  22|        10| 30000|
|  19|         8| 25000|
|  24|         4| 40000|
|  44|         3| 31000|
|  45|        21| 72000|
|   9|         2| 80000|
|  23|         1| 18000|
|null|      null| 40000|
|  34|        10| 36000|
|  35|      null|  null|
+----+----------+------+

In [5]:
df_pyspark.show()

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
| Shayema|  22|        10| 30000|
|Ehtasham|  19|         8| 25000|
| Mosahid|  24|         4| 40000|
|  Saheda|  44|         3| 31000|
|  Ghulam|  45|        21| 72000|
| Mujtaba|   9|         2| 80000|
|    Neha|  23|         1| 18000|
|    Puja|null|      null| 40000|
|    null|  34|        10| 36000|
|    null|  35|      null|  null|
+--------+----+----------+------+

In [6]:
df_pyspark.na.drop().show()   # dropping null values

+--------+---+----------+------+
|    Name|age|Experience|Salary|
+--------+---+----------+------+
| Shayema| 22|        10| 30000|
|Ehtasham| 19|         8| 25000|
| Mosahid| 24|         4| 40000|
|  Saheda| 44|         3| 31000|
|  Ghulam| 45|        21| 72000|
| Mujtaba|  9|         2| 80000|
|    Neha| 23|         1| 18000|
+--------+---+----------+------+

In [7]:
df_pyspark.na.drop(how="all").show()  # it will drop that row having all null values. Here nothing is all null

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
| Shayema|  22|        10| 30000|
|Ehtasham|  19|         8| 25000|
| Mosahid|  24|         4| 40000|
|  Saheda|  44|         3| 31000|
|  Ghulam|  45|        21| 72000|
| Mujtaba|   9|         2| 80000|
|    Neha|  23|         1| 18000|
|    Puja|null|      null| 40000|
|    null|  34|        10| 36000|
|    null|  35|      null|  null|
+--------+----+----------+------+

In [8]:
df_pyspark.na.drop(how="any").show()  # it will drop that row having any null values.

+--------+---+----------+------+
|    Name|age|Experience|Salary|
+--------+---+----------+------+
| Shayema| 22|        10| 30000|
|Ehtasham| 19|         8| 25000|
| Mosahid| 24|         4| 40000|
|  Saheda| 44|         3| 31000|
|  Ghulam| 45|        21| 72000|
| Mujtaba|  9|         2| 80000|
|    Neha| 23|         1| 18000|
+--------+---+----------+------+

In [9]:
## threshold
df_pyspark.na.drop(how="any",thresh=2).show()# all rows should have atleast 2 non-null values. the one that don't have get dropped

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
| Shayema|  22|        10| 30000|
|Ehtasham|  19|         8| 25000|
| Mosahid|  24|         4| 40000|
|  Saheda|  44|         3| 31000|
|  Ghulam|  45|        21| 72000|
| Mujtaba|   9|         2| 80000|
|    Neha|  23|         1| 18000|
|    Puja|null|      null| 40000|
|    null|  34|        10| 36000|
+--------+----+----------+------+

In [10]:
## threshold
df_pyspark.na.drop(how="any",thresh=1).show()# all rows should have atleast 1 non-null values. the one that don't have get dropped

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
| Shayema|  22|        10| 30000|
|Ehtasham|  19|         8| 25000|
| Mosahid|  24|         4| 40000|
|  Saheda|  44|         3| 31000|
|  Ghulam|  45|        21| 72000|
| Mujtaba|   9|         2| 80000|
|    Neha|  23|         1| 18000|
|    Puja|null|      null| 40000|
|    null|  34|        10| 36000|
|    null|  35|      null|  null|
+--------+----+----------+------+

In [11]:
## threshold
df_pyspark.na.drop(how="any",thresh=3).show()# all rows should have atleast 3 non-null values. the one that don't have get dropped

+--------+---+----------+------+
|    Name|age|Experience|Salary|
+--------+---+----------+------+
| Shayema| 22|        10| 30000|
|Ehtasham| 19|         8| 25000|
| Mosahid| 24|         4| 40000|
|  Saheda| 44|         3| 31000|
|  Ghulam| 45|        21| 72000|
| Mujtaba|  9|         2| 80000|
|    Neha| 23|         1| 18000|
|    null| 34|        10| 36000|
+--------+---+----------+------+

In [12]:
## subset
df_pyspark.na.drop(how="any",subset='Experience').show()  # 'Experience' having any null value gets deletes

+--------+---+----------+------+
|    Name|age|Experience|Salary|
+--------+---+----------+------+
| Shayema| 22|        10| 30000|
|Ehtasham| 19|         8| 25000|
| Mosahid| 24|         4| 40000|
|  Saheda| 44|         3| 31000|
|  Ghulam| 45|        21| 72000|
| Mujtaba|  9|         2| 80000|
|    Neha| 23|         1| 18000|
|    null| 34|        10| 36000|
+--------+---+----------+------+

In [13]:
## subset
df_pyspark.na.drop(how="any",subset='Age').show()

+--------+---+----------+------+
|    Name|age|Experience|Salary|
+--------+---+----------+------+
| Shayema| 22|        10| 30000|
|Ehtasham| 19|         8| 25000|
| Mosahid| 24|         4| 40000|
|  Saheda| 44|         3| 31000|
|  Ghulam| 45|        21| 72000|
| Mujtaba|  9|         2| 80000|
|    Neha| 23|         1| 18000|
|    null| 34|        10| 36000|
|    null| 35|      null|  null|
+--------+---+----------+------+

# Filling missing values

In [14]:
df_pyspark.na.fill('Missing value').show() ### error

+-------------+----+----------+------+
|         Name| age|Experience|Salary|
+-------------+----+----------+------+
|      Shayema|  22|        10| 30000|
|     Ehtasham|  19|         8| 25000|
|      Mosahid|  24|         4| 40000|
|       Saheda|  44|         3| 31000|
|       Ghulam|  45|        21| 72000|
|      Mujtaba|   9|         2| 80000|
|         Neha|  23|         1| 18000|
|         Puja|null|      null| 40000|
|Missing value|  34|        10| 36000|
|Missing value|  35|      null|  null|
+-------------+----+----------+------+

In [15]:
df_pyspark.na.fill('Missing values',['Experience','age']).show()  ## error

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
| Shayema|  22|        10| 30000|
|Ehtasham|  19|         8| 25000|
| Mosahid|  24|         4| 40000|
|  Saheda|  44|         3| 31000|
|  Ghulam|  45|        21| 72000|
| Mujtaba|   9|         2| 80000|
|    Neha|  23|         1| 18000|
|    Puja|null|      null| 40000|
|    null|  34|        10| 36000|
|    null|  35|      null|  null|
+--------+----+----------+------+

In [18]:
df_pyspark.show()

+--------+----+----------+------+
|    Name| age|Experience|Salary|
+--------+----+----------+------+
| Shayema|  22|        10| 30000|
|Ehtasham|  19|         8| 25000|
| Mosahid|  24|         4| 40000|
|  Saheda|  44|         3| 31000|
|  Ghulam|  45|        21| 72000|
| Mujtaba|   9|         2| 80000|
|    Neha|  23|         1| 18000|
|    Puja|null|      null| 40000|
|    null|  34|        10| 36000|
|    null|  35|      null|  null|
+--------+----+----------+------+

In [19]:
from pyspark.ml.feature import Imputer

imputer=Imputer(
    inputCols=['age','Experience','Salary'],
    outputCols=["{}_imputed".format(c) for c in ['age','Experience','Salary']]
    ).setStrategy("mean")

In [20]:
imputer.fit(df_pyspark).transform(df_pyspark).show()   # null value replaced by the mean

+--------+----+----------+------+-----------+------------------+--------------+
|    Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+--------+----+----------+------+-----------+------------------+--------------+
| Shayema|  22|        10| 30000|         22|                10|         30000|
|Ehtasham|  19|         8| 25000|         19|                 8|         25000|
| Mosahid|  24|         4| 40000|         24|                 4|         40000|
|  Saheda|  44|         3| 31000|         44|                 3|         31000|
|  Ghulam|  45|        21| 72000|         45|                21|         72000|
| Mujtaba|   9|         2| 80000|          9|                 2|         80000|
|    Neha|  23|         1| 18000|         23|                 1|         18000|
|    Puja|null|      null| 40000|         28|                 7|         40000|
|    null|  34|        10| 36000|         34|                10|         36000|
|    null|  35|      null|  null|         35|                 7|         41333|
+--------+----+----------+------+-----------+------------------+--------------+

In [21]:
from pyspark.ml.feature import Imputer

imputer=Imputer(
    inputCols=['age','Experience','Salary'],
    outputCols=["{}_imputed".format(c) for c in ['age','Experience','Salary']]
    ).setStrategy("median")

imputer.fit(df_pyspark).transform(df_pyspark).show()    # null value replaced by the median

+--------+----+----------+------+-----------+------------------+--------------+
|    Name| age|Experience|Salary|age_imputed|Experience_imputed|Salary_imputed|
+--------+----+----------+------+-----------+------------------+--------------+
| Shayema|  22|        10| 30000|         22|                10|         30000|
|Ehtasham|  19|         8| 25000|         19|                 8|         25000|
| Mosahid|  24|         4| 40000|         24|                 4|         40000|
|  Saheda|  44|         3| 31000|         44|                 3|         31000|
|  Ghulam|  45|        21| 72000|         45|                21|         72000|
| Mujtaba|   9|         2| 80000|          9|                 2|         80000|
|    Neha|  23|         1| 18000|         23|                 1|         18000|
|    Puja|null|      null| 40000|         24|                 4|         40000|
|    null|  34|        10| 36000|         34|                10|         36000|
|    null|  35|      null|  null|         35|                 4|         36000|
+--------+----+----------+------+-----------+------------------+--------------+